<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 6 changes.</summary>

```diff
# module.coreos-periphery-vm.proxmox_virtual_environment_vm.coreos_vm has changed
+ time_rotating.rotate_tailnet_key will be created
+ module.debian13.proxmox_virtual_environment_vm.vm_template will be created
+ module.ubuntu22.proxmox_virtual_environment_vm.vm_template will be created
+ module.vm_minimal_config.proxmox_virtual_environment_vm.vm will be created
- module.debian12.module.cloud_image.proxmox_virtual_environment_download_file.image will be destroyed
# (because proxmox_virtual_environment_download_file.image is not in configuration)
+ module.debian13.module.cloud_image.proxmox_virtual_environment_download_file.image will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 5 to add, 0 to change, 1 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-08-08T17:30:01Z [(view log)](https://github.com/perchnet/p/actions/runs/16836643131/job/47697617717#step:11:1).
</summary>

```hcl

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.coreos-periphery-vm.proxmox_virtual_environment_vm.coreos_vm has changed
  ~ resource "proxmox_virtual_environment_vm" "coreos_vm" {
        id                      = "131"
      ~ ipv4_addresses          = [
            # (2 unchanged elements hidden)
            [],
          + [
              + "172.17.0.1",
            ],
        ]
      ~ ipv6_addresses          = [
            # (1 unchanged element hidden)
            [
                "2600:4808:6170:3a00::8b37",
                "fdfd:3a:a7ff:0:1d1d:e653:75d:a815",
                "2600:4808:6170:3a00:a298:1a14:40e0:d66f",
                "fe80::8ef7:f2e8:aebc:7632",
            ],
          - [
              - "fe80::d26f:aa1c:3ab5:e11f",
            ],
          + [
              + "fe80::c12e:43b8:a2aa:5e18",
            ],
          + [],
        ]
      ~ mac_addresses           = [
            # (2 unchanged elements hidden)
            "00:00:00:00:00:00",
          + "DE:E3:93:86:05:14",
        ]
        name                    = "tf-coreos-periphery-E1o"
      ~ network_interface_names = [
            # (2 unchanged elements hidden)
            "tailscale0",
          + "docker0",
        ]
        tags                    = [
            "terraform",
        ]
        # (26 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # time_rotating.rotate_tailnet_key will be created
  + resource "time_rotating" "rotate_tailnet_key" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_minutes = 60
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.debian13.proxmox_virtual_environment_vm.vm_template will be created
  + resource "proxmox_virtual_environment_vm" "vm_template" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = (known after apply)
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + machine                 = "q35"
      + migrate                 = false
      + name                    = "debian13"
      + network_interface_names = (known after apply)
      + node_name               = "pve1"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + stop_on_destroy         = false
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "template",
          + "debian",
        ]
      + template                = true
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 9013

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + cores      = 1
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "host"
          + units      = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "writeback"
          + datastore_id      = "zssd"
          + discard           = "on"
          + file_format       = "raw"
          + file_id           = (known after apply)
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 8
          + ssd               = true
        }

      + initialization {
          + datastore_id         = "zssd"
          + interface            = "ide2"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = "nocloud"
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)
        }

      + memory {
          + dedicated      = 1024
          + floating       = 1024
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device (known after apply)

      + vga (known after apply)
    }

  # module.ubuntu22.proxmox_virtual_environment_vm.vm_template will be created
  + resource "proxmox_virtual_environment_vm" "vm_template" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = (known after apply)
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + machine                 = "q35"
      + migrate                 = false
      + name                    = "ubuntu22"
      + network_interface_names = (known after apply)
      + node_name               = "pve1"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + stop_on_destroy         = false
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "template",
          + "ubuntu",
        ]
      + template                = true
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 8022

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + cores      = 1
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "host"
          + units      = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "writeback"
          + datastore_id      = "zssd"
          + discard           = "on"
          + file_format       = "raw"
          + file_id           = "local:iso/ubuntu-22.04-server-cloudimg-amd64.img"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 8
          + ssd               = true
        }

      + initialization {
          + datastore_id         = "zssd"
          + interface            = "ide2"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = "nocloud"
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)
        }

      + memory {
          + dedicated      = 1024
          + floating       = 1024
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device (known after apply)

      + vga (known after apply)
    }

  # module.vm_minimal_config.proxmox_virtual_environment_vm.vm will be created
  + resource "proxmox_virtual_environment_vm" "vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + machine                 = "q35"
      + migrate                 = false
      + name                    = "vm-ubuntu22-minimal"
      + network_interface_names = (known after apply)
      + node_name               = "pve1"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = false
      + tablet_device           = false
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 10000

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + clone {
          + full    = true
          + retries = 1
          + vm_id   = 8022
        }

      + cpu {
          + cores      = 1
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "host"
          + units      = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "writeback"
          + datastore_id      = "local-lvm"
          + discard           = "on"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 8
          + ssd               = true
        }

      + initialization {
          + datastore_id         = "zssd"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)

          + dns {
              + servers = []
            }

          + ip_config {
              + ipv4 {
                  + address = "dhcp"
                }
            }

          + user_account {
              + keys = [
                  + "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAILUTdPEpjE/Hjbn9jNITSAYkYWTgtTLcXW8QyfTOu2Fq",
                ]
            }
        }

      + memory {
          + dedicated      = 1024
          + floating       = 1024
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + vga {
          + memory = 16
          + type   = "std"
        }
    }

  # module.debian12.module.cloud_image.proxmox_virtual_environment_download_file.image will be destroyed
  # (because proxmox_virtual_environment_download_file.image is not in configuration)
  - resource "proxmox_virtual_environment_download_file" "image" {
      - checksum            = "a7dfe434afc40afb0a791c777f3edba6b1a5c4b7315a61073fe5e34752d3bc5fd44ff67ef054eb4263687a97f7ce4896bf5bad5f216ef8b9d4a84541759e743d" -> null
      - checksum_algorithm  = "sha512" -> null
      - content_type        = "iso" -> null
      - datastore_id        = "local" -> null
      - file_name           = "debian-12-generic-amd64.img" -> null
      - id                  = "local:iso/debian-12-generic-amd64.img" -> null
      - node_name           = "pve1" -> null
      - overwrite           = false -> null
      - overwrite_unmanaged = false -> null
      - size                = 436600832 -> null
      - upload_timeout      = 600 -> null
      - url                 = "https://cloud.debian.org/images/cloud/trixie/20250806-2196/debian-13-generic-amd64-20250806-2196.qcow2" -> null
      - verify              = true -> null
    }

  # module.debian13.module.cloud_image.proxmox_virtual_environment_download_file.image will be created
  + resource "proxmox_virtual_environment_download_file" "image" {
      + checksum            = "a7dfe434afc40afb0a791c777f3edba6b1a5c4b7315a61073fe5e34752d3bc5fd44ff67ef054eb4263687a97f7ce4896bf5bad5f216ef8b9d4a84541759e743d"
      + checksum_algorithm  = "sha512"
      + content_type        = "iso"
      + datastore_id        = "local"
      + file_name           = "debian-13-generic-amd64.img"
      + id                  = (known after apply)
      + node_name           = "pve1"
      + overwrite           = false
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = "https://cloud.debian.org/images/cloud/trixie/20250806-2196/debian-13-generic-amd64-20250806-2196.qcow2"
      + verify              = true
    }

Plan: 5 to add, 0 to change, 1 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-39-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->